/* 
Создать шаблонный класс двусвязного списка List. Для этого класса
реализовать следующие методы:
▪ конструктор по умолчанию;
▪ конструктор копирования;
▪ конструктор перемещения;
▪ деструктор;
▪ добавление элемента в конец списка;
▪ добавление элемента в указанную позицию;
▪ удаление элемента с начала списка;
▪ удаление элемента из указанной позиции;
▪ вывод на экран содержимого списка;
▪ перегрузить оператор присваивания(&);
▪ перегрузить оператор присваивания(&&);
▪ сортировка списка по возрастанию(убыванию).
 */

