1. Написать программу, которая инициализирует элементы массива
нечетными целыми числами от 0 до 20. Вывести содержимое
массива с нумерацией элементов.

#include <iostream>
using namespace std;

int main()
{
    const int size = 20;
    int arr[size]{};
    for (int i = 0; i < size / 2; i++)
    {
        cout << i<<" --> ";
        arr[i] = i * 2 + 1;
        cout << arr[i] << endl;
    }
}

2. Написать программу, которая выводит содержимое массива
наоборот. Входными данными является массив из 10 элементов,
заполненный пользователем с клавиатуры.

#include <iostream>
using namespace std;

int main()
{
    const int size = 10;
    int arr[size]{};
    int x;
    for (int i = 0; i < size; i++)
    {
        cout << " Enter number --> ";
        cin >> x;
        arr[i] = x;
    }
    cout << "\n\nReversed massive : " << endl;
    for (int i = size - 1; i >= 0; i--)
    {
        arr[i];
        cout << arr[i] << " ";
    }
}

3. Написать программу, в которой пользователь заполняет массив
из 10 чисел.
Найти:
a. произведение всех элементов массива.
b. максимальный элемент.
c. позицию минимального элемента.
d. количество элементов равных нулю.

#include <iostream>
using namespace std;

int main()
{
    const int size = 10;
    int arr[size]{};
    int x, prod = 1, max, min, min_i = 0, zeros = 0;
    for (int i = 0; i < size; i++)
    {
        cout << " Enter number --> ";
        cin >> x;
        arr[i] = x;
    }
    max=arr[0];
    min = arr[0];
    for (int i = 0; i < size; i++)
    {
        prod *= arr[i];
        (arr[i] > max) ? max = arr[i] : max = max;
        (arr[i] < min) ? min = arr[i], min_i = i : min_i = min_i;
        (arr[i] == 0) ? zeros++ : zeros = zeros;
    }
    cout << "\nProduct of numbers : " << prod << endl;
    cout << "\nBiggest number : " << max << endl;
    cout << "\nPosition of minimal number : " << min_i << endl;
    cout << "\nAmmount of zeros : " << zeros << endl;
}

4. Написать программу, в которой пользователь заполняет массив
из 5 чисел. Вывести на экран сначала все положительные его
элементы, а затем все отрицательные.

#include <iostream>
using namespace std;

int main()
{
    const int size = 5;
    int arr[size]{};
    int x;
    for (int i = 0; i < size; i++)
    {
        cout << " Enter number --> ";
        cin >> x;
        arr[i] = x;
    }
    cout << "\nPositive numbers :" << endl;
    for (int i = 0; i < size; i++)
    {
        if (arr[i] >= 0)
        {
            cout << arr[i] << " ";
        }
    }
    cout << "\nNegative numbers :" << endl;
    for (int i = 0; i < size; i++)
    {
        if (arr[i] < 0)
        {
            cout << arr[i] << " ";
        }
    }
}

