1. Написать программу, которая случайным образом заполняет двумерный
массив размерностью 3х4 цифрами от -20 до 10. Необходимо найти
количество отрицательных элементов.

#include <iostream>
#include <ctime>
#include <iomanip> //форматирование вывода
using namespace std;

int main()
{
    srand(time(0));
    const int row = 3, col = 4;
    int max = 10, min = -20;
    int arr[row][col]{};
    int count = 0;
    for (int i = 0; i < row; i++)
    {
        for (int j = 0; j < col; j++)
        {
            arr[i][j] = rand() % (max - min) + min; // формула диапазона

            if (arr[i][j] < 0)
            {
                count++;
            }

            cout << setw(5) << arr[i][j];
        }
        cout << endl;
    }
    cout << "\nAmmount of negative numbers = " << count << endl;
}


2. Написать программу, которая случайным образом заполняет двумерный
массив размером 6х6 цифрами от 0 до 10 и одномерный массив из 6-ти
чисел. Нужно нечетные строки двумерного массива заменить на одномерный
массив.

#include <iostream>
#include <ctime>
#include <iomanip> //форматирование вывода
using namespace std;

int main()
{
    srand(time(0));
    const int row = 6, col = 6;
    int max = 10, min = 0;
    int arr[row][col]{}, brr[row]{};
    for (int i = 0; i < row; i++)
    {
        brr[i] = rand() % (max - min) + min;
        for (int j = 0; j < col; j++)
        {
            arr[i][j] = rand() % (max - min) + min; // формула диапазона

            cout << setw(3) << arr[i][j];
        }
        cout << endl;
    }
    cout << endl;
    for (int i = 0; i < row; i++)
    {
        cout << setw(3) << brr[i];
    }
    cout << "\n\n Modified massive :" << endl;

    for (int i = 0; i < row; i++)
    {
        for (int j = 0; j < col; j++)
        {
            if (i % 2 != 0)
            {
                arr[i][j] = brr[j];
            }
            cout << setw(3) << arr[i][j];
        }
        cout << endl;
    }
}


3. Написать программу, которая случайным образом заполняет двумерный
массив размером 3х4 цифрами от 0 до 4. Найти произведение ненулевых
элементов массива.

#include <iostream>
#include <ctime>
#include <iomanip> //форматирование вывода
using namespace std;

int main()
{
    srand(time(0));
    const int row = 3, col = 4;
    int max = 4, min = 0;
    int arr[row][col]{};
    int count = 1;
    for (int i = 0; i < row; i++)
    {
        for (int j = 0; j < col; j++)
        {
            arr[i][j] = rand() % (max - min) + min; // формула диапазона
            if (arr[i][j] != 0)
            {
                count *= arr[i][j];
            }
            cout << setw(3) << arr[i][j];
        }
        cout << endl;
    }
    cout << "\nProduct of not zero numbers --> " << count << endl;
}


4. Написать программу, которая случайным образом заполняет двумерный
массив размером 5х5 цифрами от 0 до 10. Поменять местами главную и
побочную диагональ.

#include <iostream>
#include <ctime>
#include <iomanip> //форматирование вывода
using namespace std;
//меняет основную диагональ массива с побочной 
int main()
{
    srand(time(0));
    const int row = 5, col = 5;
    int max = 10, min = 0;
    int arr[row][col]{};
    for (int i = 0; i < row; i++)
    {
        for (int j = 0; j < col; j++)
        {
            arr[i][j] = rand() % (max - min) + min; // формула диапазона
            cout << setw(3) << arr[i][j];
        }
        cout << endl;
    }
    cout << "\nModified massive --> " << endl;
    for (int i = 0; i < row; i++)
    {
        for (int j = 0; j < col; j++)
        {

            if (i + j == row - 1)
            {
                cout << setw(3) << arr[i][0 + i];
            }
            else if (i == j)
            {
                cout << setw(3) << arr[i][col - 1 - i];
            }
            else
            {
                cout << setw(3) << arr[i][j];
            }
        }
        cout << endl;
    }
}


5. Написать программу, которая случайным образом заполняет двумерный
массив размером 6х6 цифрами от 0 до 10. Поменять местами 1-ю и 2-ю
строки, 3-ю и 4-ю строки, 5-ю и 6-ю строки двумерного массива.

#include <iostream>
#include <ctime>
#include <iomanip> //форматирование вывода
using namespace std;
//меняет основную диагональ массива с побочной
int main()
{
    srand(time(0));
    const int row = 6, col = 6;
    int max = 10, min = 0;
    int arr[row][col]{};
    for (int i = 0; i < row; i++)
    {
        for (int j = 0; j < col; j++)
        {
            arr[i][j] = rand() % (max - min) + min; // формула диапазона
            cout << setw(3) << arr[i][j];
        }
        cout << endl;
    }
    cout << "\nModified massive --> " << endl;
    for (int i = 0; i < row; i++)
    {
        for (int j = 0; j < col; j++)
        {
            if (i % 2 == 0)
            {
                cout << setw(3) << arr[i + 1][j];
            }
            else
            {
                cout << setw(3) << arr[i - 1][j];
            }
        }
        cout << endl;
    }
}


